//
//  InformationModel.swift
//  TravelMap
//
//  Created by Даниил Петров on 23.07.2021.
//

struct InformationModel {
    let information = "Travel map - это приложение для отметок стран и городов. Отмечайте страны в которых вы были, просматривайте картинки ваших стран и список городов, которые вы посетили." + "\n\n" +
        "Как это работает? " + "\n" +
        "1. Для добавления страны нажмите на кнопку плюс и введите ее название." + "\n" +
        "2. Вы окажитесь в режиме просмотра страны, здесь вы можете повторить первый пункт и добавить город." + "\n" +
        "3. Вы можете просмотреть детальную информацию для текущей страны." + "\n" +
        "4. Чтобы вернуть к общей карте нажмите кнопку назад." + "\n" +
        "5. Также, информация о странах доступна и на первом экране." + "\n\n" +
        "Как удалять данные?" + "\n" +
        "1. Страны можно удалять свайпом из таблицы, либо нажав на корзину в детальной информации." + "\n" +
        "2. Города также можно удалять свайпом, либо нажать на сам город на карте и появить кнопка удаления." + "\n" +
        "3. А можно и все сразу в настройках приложения."
}
