//
//  InformationModel.swift
//  TravelMap
//
//  Created by Даниил Петров on 23.07.2021.
//

struct InformationModel {
    let information = "Travel map - это приложение для отметок стран и городов. Отмечайте страны в которых вы были, просматривайте картинки ваших стран, добавляйте города которые вы посетили."
        + "\n\n" +
        "Как добавлять страны?"
        + "\n\n" +
        "Добавить страну можно на вкладке Страны и Карта. Нажмите на плюс и введите название страны."
        + "\n\n" +
        "Как добавить город?"
        + "\n\n" +
        "На вкладке Карта, после добавления страны вы окажитесь в режиме просмотра этой страны. Чтобы добавить город нужно нажать на плюс и ввести название города, также города можно добавлять внури экрана с детальной информацией о стране."
        + "\n\n" +
        "Что такое режим просмотра страны?"
        + "\n\n" +
        "При добавлении новой страны или при выборе ранее добавленной страны на карте вы окажитесь в режиме просмотра страны. В данном режиме устанавливаются определенные границы для карты, чтобы открыть полную карту необходимо нажать на стрелочку назад."
        + "\n\n" +
        "Как открыть экран с детальной информацией о стране?"
        + "\n\n" +
        "Экран с детальной инфомрмацией о стране можно открыть двумя способами: выбрать соответствующую страну на экране Страны или нажать на кнопку информация (у выбранной страны) на экране Карта."
        + "\n\n" +
        "Как удалить страну?"
        + "\n\n" +
        "Удалить страну можно свайпом из таблицы на экране Страны или нажать на корзину, на экране с детальной информацией о стране."
        + "\n\n" +
        "Как удалить город?"
        + "\n\n" +
        "Удалить город можно свайпом из таблицы на экране с детальной информацией о стране или нажав на крестик (у выбранного города) на экране Карта."
        + "\n\n" +
        "Как удалить все данные?"
        + "\n\n" +
        "Удалить все данные можно на экране Настройки."
}
